<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"cc37dce38b58b3d976dfb5cc91acda35f543c004d542113895929ef8f9b16608","plan_job_ref":"Job Terraform Plan #71 at https://github.com/ironashram/kub1k/actions/runs/8575282538","plan_out_hash":"7500957f70e9162ef72f5d531f8d1580f410430bdfeb4f3f53c80e835ceabb39","plan_hash":"56958cf9f9c5bc8c65e87a24797202501401e670d14ac4d2490cb8f479dffdd3","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 1 to add, 4 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_apps[0].helm_release.argocd will be updated in-place
!~  resource "helm_release" "argocd" {
        id                         = "argocd"
!~      metadata                   = [
-           {
-               app_version = "v2.10.4"
-               chart       = "argo-cd"
-               name        = "argocd"
-               namespace   = "argocd"
-               revision    = 7
-               values      = jsonencode(
                    {
-                       applicationSet = {
-                           enabled = false
                        }
-                       configs        = {
-                           params       = {
-                               "server.insecure" = true
                            }
-                           repositories = {
-                               kub1k = {
-                                   name     = "(sensitive value)"
-                                   password = "(sensitive value)"
-                                   type     = "git"
-                                   url      = "(sensitive value)"
-                                   username = "(sensitive value)"
                                }
                            }
                        }
-                       controller     = {
-                           enableStatefulSet = true
-                           metrics           = {
-                               enabled = true
                            }
                        }
-                       dex            = {
-                           enabled = false
                        }
-                       notifications  = {
-                           enabled = false
                        }
-                       redis-ha       = {
-                           enabled = false
                        }
-                       repoServer     = {
-                           metrics  = {
-                               enabled = true
                            }
-                           replicas = 1
                        }
-                       server         = {
-                           certificate = {
-                               domain  = "argocd.lab.m1k.cloud"
-                               enabled = true
-                               issuer  = {
-                                   group = "cert-manager.io"
-                                   kind  = "ClusterIssuer"
-                                   name  = "letsencrypt-prod"
                                }
                            }
-                           ingress     = {
-                               enabled          = true
-                               hostname         = "argocd.lab.m1k.cloud"
-                               ingressClassName = "nginx"
-                               tls              = true
                            }
-                           replicas    = 1
                        }
                    }
                )
-               version     = "6.7.3"
            },
        ] -> (known after apply)
        name                       = "argocd"
!~      version                    = "6.7.3" -> "6.7.10"
#        (26 unchanged attributes hidden)

#        (5 unchanged blocks hidden)
    }

  # module.provision_apps[0].helm_release.metallb_ingress will be updated in-place
!~  resource "helm_release" "metallb_ingress" {
        id                         = "metallb"
!~      metadata                   = [
-           {
-               app_version = "v0.14.3"
-               chart       = "metallb"
-               name        = "metallb"
-               namespace   = "metallb-system"
-               revision    = 3
-               values      = jsonencode({})
-               version     = "0.14.3"
            },
        ] -> (known after apply)
        name                       = "metallb"
!~      version                    = "0.14.3" -> "0.14.4"
#        (26 unchanged attributes hidden)
    }

  # module.provision_apps[0].helm_release.tigera_operator will be updated in-place
!~  resource "helm_release" "tigera_operator" {
        id                         = "tigera-operator"
!~      metadata                   = [
-           {
-               app_version = "v3.27.2"
-               chart       = "tigera-operator"
-               name        = "tigera-operator"
-               namespace   = "tigera-operator"
-               revision    = 4
-               values      = jsonencode(
                    {
-                       installation = {
-                           calicoNetwork = {
-                               ipPools = [
-                                   {
-                                       blockSize     = 26
-                                       cidr          = "10.49.0.0/21"
-                                       encapsulation = "VXLANCrossSubnet"
-                                       natOutgoing   = "Enabled"
-                                       nodeSelector  = "all()"
                                    },
                                ]
                            }
                        }
                    }
                )
-               version     = "v3.27.2"
            },
        ] -> (known after apply)
        name                       = "tigera-operator"
!~      version                    = "v3.27.2" -> "v3.27.3"
#        (26 unchanged attributes hidden)
    }

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-04-03T21:08:19Z" -> (known after apply)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #71](https://github.com/ironashram/kub1k/actions/runs/8575282538)